In [2]:
! pip install pandas

Collecting pandas
  Downloading pandas-2.2.0-cp311-cp311-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.0-cp311-cp311-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   - -------------------------------------- 0.4/11.6 MB 11.6 MB/s eta 0:00:01
   --- ------------------------------------ 0.9/11.6 MB 11.2 MB/s eta 0:00:01
   ----- ---------------------------------- 1.6/11.6 MB 12.9 MB/s eta 0:00:01
   -------- ------------------------------- 2.4/11.6 MB 15.1 MB/s eta 0:00:01
   ----------- ---------------------------- 3.4/11.6 MB 18.0 MB/s eta 0:00:01
   ------------ --------------------------- 3.7/11.6 MB 16.0 MB/s eta 0:00:01
   ----------------- ---------------------- 5.0/11.6 MB 17.8 MB/s eta 0:00:01
   ---------------------- ----------------- 6.6/11.6 MB 20.2 MB/s eta 0:00:01
   ---------------------------- ----------- 8.1/11.6 MB 21.6 MB/s eta 0:00:01
   ---------------------------- ----------- 8.4/11.6 MB 22.3 MB/s eta 0:00:01
   ---------------------------- ----------- 8.4/11.6 MB 22.3 MB/s eta 0:00:01
   ---------------------------- ----------- 8.4/11.6 MB 22.3 MB/s eta 0:00:01
   ---------------------------- ----------- 8.4/11.6 MB 22.3 MB/s eta 0:00:01
   ---------------------------- ----------- 8.4/11.6 MB 22.3 MB/s eta 0:00:01
   ----------------------------------- ---- 10.1/11.6 MB 15.8 MB/s eta 0:00:01
   ---------------------------------------  11.6/11.6 MB 18.2 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 16.8 MB/s eta 0:00:00
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ---------------------------------------- 0.0/505.5 kB ? eta -:--:--
   --------------------------------------- 505.5/505.5 kB 33.0 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ---------------------------------------- 0.0/345.4 kB ? eta -:--:--
   ---------------------------------------- 345.4/345.4 kB ? eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.0 pytz-2024.1 tzdata-2024.1

In [20]:
import pandas as pd

In [4]:
s1 = pd.Series([10,20,30,40,5])     #pandas의 Series를 사용하면 index와 같이 출력됨을 확인할 수 있다.
s1

0    10
1    20
2    30
3    40
4     5
dtype: int64

In [6]:
s1.index        #Series는 index와 values를 분리해서 가져올 수 있다.
print(s1.index) #데이터의 갯수를 파악하는데 용이

RangeIndex(start=0, stop=5, step=1)

In [7]:
s1.values   #array형태로 value값 데이터타입을 확인할 수 있다.

array([10, 20, 30, 40,  5], dtype=int64)

In [8]:
s2 = pd.Series(['a','b','c',1,2,3]) #데이터타입은 String이 있기에 문자열(object)로 나오게 됨 
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [18]:
import numpy as np

s3 = pd.Series([np.nan,10,30])      #결과값에서 볼 수 있듯이 nan은 float형태이다
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [14]:
index_date = ['2018-10-07', '2018-10-08', '2018-10-09', '2018-10-10']
s4 = pd.Series([200, 195, np.nan, 205], index = index_date)
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [17]:
s5 = pd.Series({'국어' : 100, '영어': 95, '수학' : 90}) #딕셔너리에서는 key값이 index를 대신한다 결국 국어 영어 수학이 key값이자 index값이 되는 것
s5

국어    100
영어     95
수학     90
dtype: int64

In [3]:
pd.date_range(start='2019-01-01',end='2019-01-07')  #freq = 'D' day 기준이라는 뜻 년-월-일 일-월-년  순서하거나 - / . 로 구분지을 수 있다.

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [4]:
pd.date_range(start='2019-01-01', periods = 7, freq = 'MS')

DatetimeIndex(['2019-01-01', '2019-02-01', '2019-03-01', '2019-04-01',
               '2019-05-01', '2019-06-01', '2019-07-01'],
              dtype='datetime64[ns]', freq='MS')

In [7]:
pd.date_range(start='2019-01-01', periods = 7, freq = 'BME')

DatetimeIndex(['2019-01-31', '2019-02-28', '2019-03-29', '2019-04-30',
               '2019-05-31', '2019-06-28', '2019-07-31'],
              dtype='datetime64[ns]', freq='BME')

In [9]:
pd.date_range(start='2019-01-01', periods = 3, freq = 'AS')

C:\Users\user\AppData\Local\Temp\ipykernel_15116\895383405.py:1: FutureWarning: 'AS' is deprecated and will be removed in a future version, please use 'YS' instead.
  pd.date_range(start='2019-01-01', periods = 3, freq = 'AS')

DatetimeIndex(['2019-01-01', '2020-01-01', '2021-01-01'], dtype='datetime64[ns]', freq='YS-JAN')

In [11]:
pd.date_range(start='2019-01-01 08:00', periods = 10, freq = 'h')

DatetimeIndex(['2019-01-01 08:00:00', '2019-01-01 09:00:00',
               '2019-01-01 10:00:00', '2019-01-01 11:00:00',
               '2019-01-01 12:00:00', '2019-01-01 13:00:00',
               '2019-01-01 14:00:00', '2019-01-01 15:00:00',
               '2019-01-01 16:00:00', '2019-01-01 17:00:00'],
              dtype='datetime64[ns]', freq='h')

In [12]:
pd.date_range(start='2019-01-01 08:00', periods = 10, freq = 'bh')

DatetimeIndex(['2019-01-01 09:00:00', '2019-01-01 10:00:00',
               '2019-01-01 11:00:00', '2019-01-01 12:00:00',
               '2019-01-01 13:00:00', '2019-01-01 14:00:00',
               '2019-01-01 15:00:00', '2019-01-01 16:00:00',
               '2019-01-02 09:00:00', '2019-01-02 10:00:00'],
              dtype='datetime64[ns]', freq='bh')

In [13]:
pd.DataFrame([[1,2,3,],[4,5,6],[7,8,9]])    #데이터 프레임 형태의 배열 생성

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [15]:
import numpy as np

data_list = np.array([[10,20,30],[40,50,60],[70,80,90]])    #numpy배열데이터로도 데이터프레임 형태로 출력이 가능하다.
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [26]:
data = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
index_data = pd.date_range('2019-09-01', periods = 4)
columns_list = ['A', 'B', 'C']
pd.DataFrame(data, index=index_data, columns=columns_list)

             A   B   C
2019-09-01   1   2   3
2019-09-02   4   5   6
2019-09-03   7   8   9
2019-09-04  10  11  12

In [31]:
table_data = {'연도': [2015, 2016, 2016, 2017, 2017],
              '지사': ['한국', '한국', '미국', '한국', '미국'],
              '고객 수': [200, 250, 450, 300, 500]}
table_data

{'연도': [2015, 2016, 2016, 2017, 2017],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객 수': [200, 250, 450, 300, 500]}

In [18]:
pd.DataFrame(table_data)

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

In [19]:
df = pd.DataFrame(table_data, columns=['연도', '지사', '고객 수'])
df

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

In [24]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [21]:
df.columns

Index(['연도', '지사', '고객 수'], dtype='object')

In [22]:
df.values

array([[2015, '한국', 200],
       [2016, '한국', 250],
       [2016, '미국', 450],
       [2017, '한국', 300],
       [2017, '미국', 500]], dtype=object)

In [27]:
s1 = pd.Series([1,2,3,4,5])         #pandas 역시 numpy기반이기에 시리즈나 데이터프레임으로 생성한 데이터끼리는 사칙연산이 가능하다
s2 = pd.Series([10,20,30,40,50])
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [28]:
s2 -s1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [29]:
s1 * s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [30]:
s2 / s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [32]:
s3 = pd.Series([1,2,3,4])
s4 = pd.Series([10,20,30,40,50])
s3 + s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [33]:
table_data1 = {'A': [1, 2, 3, 4, 5],
              'B': [10, 20, 30, 40, 50],
              'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [34]:
table_data3 = {'봄':  [256.5, 264.3, 215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']

df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [35]:
df3.mean()

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64

In [36]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64

In [37]:
df3.mean(axis=1)

2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [38]:
df3.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  303.420000   98.660000
std     38.628267  148.888895   67.358496   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  293.100000  108.100000
75%    264.300000  599.800000  363.500000  109.100000
max    312.800000  770.600000  381.600000  139.300000

In [39]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 2012 to 2016
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   봄       5 non-null      float64
 1   여름      5 non-null      float64
 2   가을      5 non-null      float64
 3   겨울      5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [41]:
KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [42]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [43]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [44]:
df_KTX.head(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

In [45]:
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [46]:
df_KTX[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0